change ui diagram types in doc
